iter2_hbase/output/hbase_load_a_150000.txt
[WARN]  The 'hbase10' client has been deprecated because HBase 1.0 is EOM. If you are using HBase 1.2+ try using the 'hbase12' client instead.
java -cp /usr/local/ycsb-0.14.0/hbase10-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/protobuf-java-2.5.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-compress-1.4.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/paranamer-2.3.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/findbugs-annotations-1.3.9-1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-lang-2.6.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-httpclient-3.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jaxb-api-2.2.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/htrace-core-3.1.0-incubating.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/api-util-1.0.0-M20.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-net-3.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/log4j-1.2.17.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jcodings-1.0.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-codec-1.9.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-auth-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-logging-1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-cli-1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jetty-util-6.1.26.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/apacheds-kerberos-codec-2.0.0-M15.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-annotations-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jackson-mapper-asl-1.8.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/netty-all-4.0.23.Final.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/apacheds-i18n-2.0.0-M15.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/httpcore-4.2.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-math3-3.1.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-protocol-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-common-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/guava-12.0.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-el-1.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/activation-1.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-annotations-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-collections-3.2.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-mapreduce-client-core-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-yarn-common-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jsr305-1.3.9.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/slf4j-log4j12-1.7.7.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-configuration-1.6.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-beanutils-1.7.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-digester-1.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/avro-1.7.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/xz-1.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/snappy-java-1.0.4.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-io-2.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/joni-2.1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-client-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase10-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/netty-3.6.2.Final.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-common-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/httpclient-4.2.5.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jsch-0.1.42.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-yarn-api-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/xmlenc-0.52.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-beanutils-core-1.8.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/api-asn1-api-1.0.0-M20.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/stax-api-1.0-2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/zookeeper-3.4.6.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.HBaseClient10 -s -P workloads/workloada -p recordcount=150000 -p table=usertable -p columnfamily=family -load
Command line: -db com.yahoo.ycsb.db.HBaseClient10 -s -P workloads/workloada -p recordcount=150000 -p table=usertable -p columnfamily=family -load
YCSB Client 0.14.0

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2018-12-19 05:23:04:475 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-19 05:23:14:442 10 sec: 11712 operations; 1171.2 current ops/sec; est completion in 1 minute [INSERT: Count=11712, Max=134655, Min=397, Avg=727.54, 90=786, 99=4467, 99.9=10895, 99.99=24895] 
2018-12-19 05:23:24:442 20 sec: 29594 operations; 1788.2 current ops/sec; est completion in 1 minute [INSERT: Count=17882, Max=22015, Min=362, Avg=553.4, 90=578, 99=1241, 99.9=6611, 99.99=11631] 
2018-12-19 05:23:34:442 30 sec: 45304 operations; 1571 current ops/sec; est completion in 1 minute [INSERT: Count=15710, Max=919039, Min=352, Avg=631.34, 90=596, 99=1093, 99.9=6859, 99.99=15839] 
2018-12-19 05:23:44:442 40 sec: 63806 operations; 1850.2 current ops/sec; est completion in 55 seconds [INSERT: Count=18502, Max=24511, Min=367, Avg=535.51, 90=584, 99=1507, 99.9=6931, 99.99=15239] 
2018-12-19 05:23:54:442 50 sec: 80504 operations; 1669.8 current ops/sec; est completion in 44 seconds [INSERT: Count=16698, Max=13527, Min=373, Avg=594.49, 90=664, 99=962, 99.9=7379, 99.99=9087] 
2018-12-19 05:24:04:442 60 sec: 99681 operations; 1917.7 current ops/sec; est completion in 31 seconds [INSERT: Count=19177, Max=12999, Min=334, Avg=517.8, 90=552, 99=849, 99.9=6527, 99.99=9159] 
2018-12-19 05:24:14:442 70 sec: 116879 operations; 1719.8 current ops/sec; est completion in 20 seconds [INSERT: Count=17198, Max=31423, Min=363, Avg=577.38, 90=649, 99=978, 99.9=8447, 99.99=16607] 
2018-12-19 05:24:24:443 80 sec: 129605 operations; 1272.6 current ops/sec; est completion in 13 seconds [INSERT: Count=12726, Max=992767, Min=330, Avg=683.32, 90=743, 99=2053, 99.9=8139, 99.99=17247] 
2018-12-19 05:24:34:442 90 sec: 133424 operations; 381.9 current ops/sec; est completion in 12 seconds [INSERT: Count=3819, Max=8183807, Min=429, Avg=2943.19, 90=853, 99=6491, 99.9=15967, 99.99=8183807] 
2018-12-19 05:24:44:442 100 sec: 147065 operations; 1364.1 current ops/sec; est completion in 2 second [INSERT: Count=13641, Max=956415, Min=355, Avg=729.17, 90=730, 99=3369, 99.9=10855, 99.99=330495] 
2018-12-19 05:24:46:580 102 sec: 150000 operations; 1373.42 current ops/sec; [CLEANUP: Count=2, Max=161919, Min=38, Avg=80947, 90=161919, 99=161919, 99.9=161919, 99.99=161919] [INSERT: Count=2935, Max=8639, Min=405, Avg=668.34, 90=717, 99=1528, 99.9=8039, 99.99=8639] 
[OVERALL], RunTime(ms), 102137
[OVERALL], Throughput(ops/sec), 1468.6156828573387
[TOTAL_GCS_PS_Scavenge], Count, 79
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 259
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.25358097457336715
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 79
[TOTAL_GC_TIME], Time(ms), 259
[TOTAL_GC_TIME_%], Time(%), 0.25358097457336715
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 80947.0
[CLEANUP], MinLatency(us), 38
[CLEANUP], MaxLatency(us), 161919
[CLEANUP], 95thPercentileLatency(us), 161919
[CLEANUP], 99thPercentileLatency(us), 161919
[INSERT], Operations, 150000
[INSERT], AverageLatency(us), 665.8252266666667
[INSERT], MinLatency(us), 330
[INSERT], MaxLatency(us), 8183807
[INSERT], 95thPercentileLatency(us), 751
[INSERT], 99thPercentileLatency(us), 2015
[INSERT], Return=OK, 150000